<a href="https://colab.research.google.com/github/atif4/Q2/blob/gh-pages/astronauts.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#hide earrings 
import warnings
warnings.filterwarnings('ignore')
import pandas as pd
import numpy as np

In [2]:
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
plt.style.use('seaborn')

In [3]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

In [4]:
"""from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense"""
from tensorflow.keras.optimizers import Adam, SGD
from keras import regularizers
from keras import layers
from tensorflow.keras import models

In [5]:
df = pd.read_csv("/content/drive/MyDrive/Dataset/astronauts.csv")
df.head(3)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,NaN,NaN,Retired,3/7/1936,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 357 non-null    object
 1   Year                 330 non-null    float64
 2   Group                330 non-null    float64
 3   Status               357 non-null    object
 4   Birth Date           357 non-null    object
 5   Birth Place          357 non-null    object
 6   Gender               357 non-null    object
 7   Alma Mater           356 non-null    object
 8   Undergraduate Major  335 non-null    object
 9   Graduate Major       298 non-null    object
 10  Military Rank        207 non-null    object
 11  Military Branch      211 non-null    object
 12  Space Flights        357 non-null    int64
 13  Space Flight (hr)    357 non-null    int64
 14  Space Walks          357 non-null    int64
 15  Space Walks (hr)     357 non-null    float64
 16  Missions             334 non-null    object
 17  Death Date           52 non-null     object
 18  Death Mission        16 non-null     object
dtypes: float64(3), int64(3), object(13)
memory usage: 53.1+ KB

In [7]:
df.columns

Index(['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place',
       'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       'Military Rank', 'Military Branch', 'Space Flights',
       'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions',
       'Death Date', 'Death Mission'],
      dtype='object')

In [8]:
df.isnull().sum()

Name                     0
Year                    27
Group                   27
Status                   0
Birth Date               0
Birth Place              0
Gender                   0
Alma Mater               1
Undergraduate Major     22
Graduate Major          59
Military Rank          150
Military Branch        146
Space Flights            0
Space Flight (hr)        0
Space Walks              0
Space Walks (hr)         0
Missions                23
Death Date             305
Death Mission          341
dtype: int64

In [9]:
def get_each_dtpyes(col_list):
    ob = []
    integer = []
    fl = []
    data_time = []
    bol = []
    for i in col_list:
        if df[i].dtypes == 'object':
            ob.append(i)
        if df[i].dtypes == 'int64':
            integer.append(i)
        if  df[i].dtypes == 'float64':
            fl.append(i)
        if df[i].dtypes == 'datetime64[ns]':
            data_time.append(i)
        if df[i].dtypes == "bool":
            bol.append(i)
    return print(f"list of object dtpyes:\n{ob}\n{len(ob)}\n\nlist of integers dtypes:\n{integer}\n{len(integer)}\n\nlist of float dtypes:\n{fl}\n{len(fl)}\n\nlist of datatime dtype:\n{data_time}\n{len(data_time)}\nlist of datatime dtype:\n{bol}\n{len(bol)}\n")
get_each_dtpyes(['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place', 'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       'Military Rank', 'Military Branch', 'Space Flights', 'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions', 'Death Date', 'Death Mission'])

list of object dtpyes:
['Name', 'Status', 'Birth Date', 'Birth Place', 'Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major', 'Military Rank', 'Military Branch', 'Missions', 'Death Date', 'Death Mission']
13

list of integers dtypes:
['Space Flights', 'Space Flight (hr)', 'Space Walks']
3

list of float dtypes:
['Year', 'Group', 'Space Walks (hr)']
3

list of datatime dtype:
[]
0
list of datatime dtype:
[]
0

In [10]:
null_value = {}
not_null_value = {}
def get_null_value_col(list_col):
  for i in list_col:
    if df[i].isnull().sum() == 0:
      not_null_value[i]=df[i].isnull().sum()
    else:
      null_value[i]=df[i].isnull().sum()
get_null_value_col(['Name', 'Year', 'Group', 'Status', 'Birth Date', 'Birth Place','Gender', 'Alma Mater', 'Undergraduate Major', 'Graduate Major',
       'Military Rank', 'Military Branch', 'Space Flights', 'Space Flight (hr)', 'Space Walks', 'Space Walks (hr)', 'Missions', 'Death Date', 'Death Mission'])

In [21]:
display("This is list of columns which has null values: ",null_value)
display("The number of columns which has null value are  ",len(null_value))
#display("This is list of columns which does not have null values: ",not_null_value)
#display("This is lenght of list which does not have null value: ",len(not_null_value))

'This is list of columns which has null values: '

{'Year': 27,
 'Group': 27,
 'Alma Mater': 1,
 'Undergraduate Major': 22,
 'Graduate Major': 59,
 'Military Rank': 150,
 'Military Branch': 146,
 'Missions': 23,
 'Death Date': 305,
 'Death Mission': 341}

'The number of columns which has null value are  '

10

In [12]:
update_col_dic={}
drop_col_dic ={}
def get_percentage_of_each_col(list_col):
  for i in list_col:
    if df[i].isnull().sum()/len(df)*100 > 30:
      update_col_dic[i] = df[i].isnull().sum()/len(df)*100
    else:
      drop_col_dic[i]=df[i].isnull().sum()/len(df)*100 
get_percentage_of_each_col(['Year', 'Group', 'Alma Mater', 'Undergraduate Major', 'Graduate Major', 'Military Rank', 'Military Branch', 'Missions', 'Death Date',
                            'Death Mission'])

In [13]:
display("The percentages are greater then 30 you use techniques to fill the value for following columns: ", update_col_dic)

'The percentages are greater then 30 you use techniques to fill the value for following columns: '

{'Military Rank': 42.016806722689076,
 'Military Branch': 40.896358543417364,
 'Death Date': 85.43417366946778,
 'Death Mission': 95.51820728291317}

In [14]:
display("The percentages are not greater then 30 you have to drop the following columns: ",drop_col_dic)

'The percentages are not greater then 30 you have to drop the following columns: '

{'Year': 7.563025210084033,
 'Group': 7.563025210084033,
 'Alma Mater': 0.2801120448179272,
 'Undergraduate Major': 6.162464985994398,
 'Graduate Major': 16.5266106442577,
 'Missions': 6.442577030812324}